#include<bits/stdc++.h>
using namespace std;
long long gg[101]={0,250,600,1000,2000,3500,6000,9000,15000,22500,32500,50000,70000,95000,125000,16000,20000,25000,31000,380000,50000,70000,100000,150000,200000,300000,420000,550000,700000,900000,1200000,1600000,2100000,2700000,3400000,4200000,5100000,6100000,7200000,830000,9300000,10500000,12000000,14000000,17000000,21000000,26000000,32000000,39000000,47000000,56000000,66000000,80000000,100000000,130000000,170000000,220000000,280000000,380000000,500000000,650000000,820000000,1000000000,1200000000,1500000000,1850000000,2150000000,2600000000,3100000000,3800000000,4600000000,5500000000,6500000000,7600000000,8800000000,8500000000,9200000000,10000000000,11000000000,1220000000,13500000000,15500000000,19300000000,23000000000,27500000000,33000000000,40000000000,50000000000,62000000000,75000000000,90000000000,110000000000,135000000000,164000000000,200000000000,245000000000,300000000000,360000000000,428000000000,500000000000,0};
long long gx[101]={0,2000,3000,4500,6500,10000,15000,25000,36000,50000,70000,100000,140000,200000,270000,350000,450000,600000,800000,1100000,1500000,2000000,2800000,3800000,5000000,7000000,10000000,15000000,21000000,28000000,40000000,54000000,70000000,88000000,110000000,140000000,180000000,230000000,300000000,380000000,470000000,580000000,690000000,800000000,920000000,1050000000,1200000000,136000000,155000000,175000000,196000000,220000000,250000000,290000000,350000000,420000000,500000000,600000000,720000000,850000000,1000000000,1200000000,1500000000,2000000000,2800000000,3700000000,4700000000,6000000000,7500000000,9300000000,11500000000,14000000000,18000000000,23000000000,30000000000,38000000000,50000000000,65000000000,82000000000,100000000000,120000000000,145000000000,180000000000,220000000000,270000000000,330000000000,400000000000,480000000000,580000000000,700000000000,840000000000,1000000000000,1200000000000,1500000000000,2000000000000,2600000000000,3250000000000,4000000000000,4800000000000,5800000000000,0};
long long gq[101]={0,500,800,3000,6000,12000,20000,30000,42000,55000,70000,90000,120000,160000,210000,260000,320000,400000,500000,650000,850000,1150000,1500000,2000000,2800000,4000000,6000000,8500000,11000000,15000000,20000000,26000000,31000000,37000000,44000000,52000000,61000000,71000000,82000000,96000000,110000000,125000000,142000000,160000000,180000000,205000000,232000000,260000000,290000000,325000000,365000000,400000000,450000000,510000000,580000000,660000000,760000000,880000000,1000000000,1200000000,1500000000,1900000000,2400000000,3000000000,3700000000,4500000000,55000000000,67000000000,80000000000,95000000000,115000000000,137000000000,160000000000,200000000000,245000000000,300000000000,360000000000,425000000000,500000000000,600000000000,750000000000,920000000000,1170000000000,1430000000000,1700000000000,2000000000000,2450000000000,3000000000000,3700000000000,4500000000000,5500000000000,6700000000000,8000000000000,9500000000000,11500000000000,1400000000000,1680000000000,2000000000000,2400000000000,3000000000000,0};
long long b5gx[21]={0,10000,50000,100000,500000,1000000,5000000,10000000,50000000,100000000,500000000,1000000000,5000000000,10000000000,50000000000,100000000000,500000000000,1000000000000,5000000000000,10000000000000,0};
long long b5gg[21]={0,10000,50000,100000,500000,1000000,5000000,10000000,50000000,100000000,500000000,1000000000,5000000000,10000000000,50000000000,100000000000,500000000000,1000000000000,5000000000000,10000000000000,0};
long long emg[13]={0,100000000,200000000,350000000,520000000,700000000,1000000000,1350000000,1750000000,2300000000,3000000000,4000000000,5500000000};
long long emx[13]={0,1000000000,2000000000,3500000000,5200000000,7000000000,10000000000,13500000000,17500000000,23000000000,30000000000,40000000000,55000000000};
long long js=0,d=1,o=1,oo=1,rr=0,yy,sum=1,x,g,ddd=1,lll=1,qian=1000,ggg,ggx,win=0,yq=2,tzz=1,gksx=100,tzsx=12,tzdz,tl=100,eg=0,ex=0,emsx=12,emz=1,gmcs=2,zs=2,cjcs=1,xyd=1,qq=0,sjsx=25,jjsx=20,start;
long long tzgg[13]={0,1000000,3000000,10000000,50000000,120000000,250000000,600000000,1000000000,1500000000,200000000,300000000,500000000};
long long tzgx[13]={0,1000000,3000000,10000000,50000000,120000000,250000000,600000000,1000000000,1500000000,200000000,300000000,500000000};
string ss;
string yhm;
double tzzs=1.0; 
long long txq[6]={0,1000000,5000000,10000000,50000000,100000000};
long long sjq[21]={0,100000,500000,2000000,8000000,15000000,40000000,70000000,120000000,200000000,300000000,450000000,650000000,900000000,1200000000,1600000000,2100000000,2800000000,3800000000,5000000000,6400000000};
long long a[25]={0,100,200,600,1200,1800,3500,6000,10000,15000,24000,35000,50000,70000,100000,140000,190000,250000,320000,400000,500000,700000,1000000,1500000,2100000};
long long xg[26]={0,1000,1300,1800,2500,3500,5000,7500,10500,14000,19000,28000,38000,49000,60000,75000,95000,120000,150000,190000,240000,300000,400000,520000,650000,800000};
long long yg[26]={0,800,900,1000,1400,2000,2800,4000,5500,7200,9500,12500,17000,25000,33000,45000,60000,80000,110000,150000,200000,270000,350000,450000,560000,680000};
long long xx[26]={0,600,650,750,1000,1500,2100,2800,4000,5500,7500,10000,13000,17000,23000,30000,38000,48000,60000,750000,930000,1150000,1400000,1700000,2100000,2550000};
long long yx[26]={0,800,1000,1300,1700,2400,3500,5000,7000,10000,14000,20000,27000,36000,47000,60000,75000,95000,120000,150000,190000,240000,300000,380000,480000,600000};
long long nbg[26]={0,2000,2100,2300,2600,6000,10000,10100,10200,10300,10500,18000,27000,37000,48000,60000,62000,65000,100000,140000,190000,250000,320000,400000,400010,1000000};
long long nbx[26]={0,1000,4000,12000,12100,12200,13000,13500,17000,17100,17500,18000,19000,19100,26000,30000,31000,60000,70000,100000,200000,500000,500001,1000000,1000001,1500000};
long long t7g[26]={0,1500,4000,7000,11000,15500,20000,25000,31000,38000,46000,60000,80000,110000,160000,240000,330000,430000,550000,700000,900000,1150000,1450000,1800000,2200000,2800000};
long long t7x[26]={0,20,50,100,200,400,800,1500,3000,5000,8000,11000,13000,16000,20000,25000,31000,38000,48000,60000,80000,105000,135000,170000,220000,280000};
string tx[7]={"*","小","中","大","老","神","仙"};
int xmj=0,xsj=0,xtj=0,xjj=0,xzj=0,xhj=0,zmj=0,zsj=0,ztj=0,zjj=0,zzj=0,zhj=0,dmj=0,dsj=0;
int xpt=0,xmt=0,xst=0,xtt=0,xjt=0,xzt=0,zpt=0,zmt=0,zst=0,ztt=0,zjt=0,zzt=0,dpt=0,dmt=0;
int cf();
int xswzrz=0,yhxzlz=0,ttgznz=0,btlshz;
long long xswzrg[8]={0,10000,20000,30000,50000,80000,120000,200000};
long long yhxzlx[8]={0,1000,5000,12000,20000,30000,45000,100000};
long long ttgzng[8]={0,30000,100000,300000,800000,2000000,5000000,20000000};
long long btlshg[8]={0,20000,60000,180000,540000,1500000,3000000,8000000};
long long jnq[8]={1000,3000,5500,9000,15000,22000,30000,1000000000000000000};
int gy()
{   
    cout<<"1.4.10正式版更新公告"<<endl;
    cout<<"1.本次更新内容全部检测修复"<<endl;
    cout<<"2.脑残BUG修复"<<endl;
    cout<<endl<<endl;
    cout<<"1.5.1版本预告"<<endl;
    cout<<"1.级数增加到28级"<<endl;
    cout<<"2.阶数增加到25阶"<<endl;
    cout<<"3.商店购买次数和价格以及功能调整"<<endl;
    cout<<endl;
    cout<<"任意键关闭"<<endl;
    int s31;
    cin>>s31; 
    cf(); 
}
int xhxy=0,xzd=0; 
int sd()
{
    int s45;
    if(gmcs<=0)
    {
        cout<<"您的购买次数已经用完了"<<endl; 
    }
    else
    {
        cout<<"老李商店"<<endl;
        cout<<"老李：需要买些什么呢？一次只能买一个哟！"<<endl;
        cout<<"1.皮制套装 功能：每一套血量加150000 价格：5000金币"<<endl;
        cout<<"2.小木剑 功能：每一把攻击力加10000 价格：5000金币"<<endl;
        cout<<"3.木质套装 功能：每一套血量加50000 价格：12000金币"<<endl;
        cout<<"4.小石剑 功能：每一把攻击力加30000 价格：12000金币"<<endl;
        cout<<"5.石质套装 功能：每一套血量加150000 价格：25000金币"<<endl;
        cout<<"6.小铁剑 功能：每一把攻击力加100000 价格：25000金币"<<endl; 
        cout<<"7.铁制套装 功能：每一套血量加400000 价格：60000金币"<<endl;
        cout<<"8.小金剑 功能：每一把攻击力加300000 价格：60000金币"<<endl; 
        cout<<"9.金制套装 功能：每一套血量加1000000 价格：150000金币"<<endl;
        cout<<"10.小钻剑 功能：每一把攻击力加800000 价格：150000金币"<<endl;
        cout<<"11.钻制套装 功能：每一套血量加3000000 价格：400000金币"<<endl;
        cout<<"12.小黑剑 功能：每一把攻击力加2000000 价格：400000金币"<<endl; 
        cout<<"13.小瓶回血药水 功能：关卡中可以为自己加100000滴血 价格：10000金币"<<endl;
        cout<<"14.小炸弹 功能：关卡中可以为怪扣100000滴血 价格：10000金币"<<endl; 
        cout<<"15.精品皮套 功能：每一套血量加8000000 价格：1000000金币"<<endl;
        cout<<"16.中木剑 功能：每一把攻击力加6000000 价格：1000000金币"<<endl; 
        cout<<"17.精品木套 功能：每一套血量加20000000 价格：2500000金币"<<endl;
        cout<<"18.中石剑 功能：每一把攻击力加15000000 价格：2500000金币"<<endl;
        cout<<"19.精品石套 功能：每一套血量加50000000 价格：7000000金币"<<endl; 
        cout<<"20.中铁剑 功能：每一把攻击力加40000000 价格：7000000金币"<<endl; 
        cout<<"21.精品铁套 功能：每一套血量加1.2亿 价格：20000000金币"<<endl;
        cout<<"22.中金剑 功能：每一把攻击力加1亿 价格：20000000金币"<<endl;
        cout<<"23.精品金套 功能：每一套血量加3亿 价格：50000000金币"<<endl;
        cout<<"24.中钻剑 功能：每一把攻击力加2.5亿 价格:50000000金币"<<endl; 
        cout<<"25.精品钻套 功能：每一套血量加8亿 价格：12000万金币"<<endl;
        cout<<"26.中黑剑 功能：每一把攻击力加6亿 价格：12000万金币"<<endl; 
        cout<<"27.极品皮套 功能：每一套血量加20亿 价格：5钻石"<<endl;
        cout<<"28.大木剑 功能：每一把攻击力加16亿 价格：5钻石"<<endl;
        cout<<"29.极品木套 功能：每一套血量加52亿 价格：12钻石"<<endl;
        cout<<"30.大石剑 功能：每一把攻击力加45亿 价格：12钻石"<<endl; 
        cin>>s45;
        if(s45==1)
        {
            if(qian<5000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=5000;
                ex+=15000;
                gmcs--;
                xpt++;
            }
        }
        if(s45==2)
        {
            if(qian<5000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=5000;
                eg+=10000;
                gmcs--;
                xmj++;
            }
        }
        if(s45==3)
        {
            if(qian<12000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=12000;
                ex+=50000;
                gmcs--;
                xmt++;
            }
        }
        if(s45==4)
        {
            if(qian<12000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=12000;
                eg+=30000;
                gmcs--;
                xsj++;
            }
        }
        if(s45==5)
        {
            if(qian<25000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=25000;
                ex+=150000;
                gmcs--;
                xst++;
            }
        }
        if(s45==6)
        {
            if(qian<25000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=25000;
                eg+=100000;
                gmcs--;
                xtj++;
            }
        }
        if(s45==7)
        {
            if(qian<60000)cout<<"没钱就不要买了"<<endl;
            else    
            {
                cout<<"购买成功"<<endl;
                qian-=60000;
                ex+=400000;
                gmcs--;
                xtt++;
            }
        }
        if(s45==8)
        {
            if(qian<60000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=60000;
                eg+=300000;
                gmcs--;
                xjj++;
            }
        }
        if(s45==9)
        {
            if(qian<150000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=150000;
                ex+=1000000;
                gmcs--;
                xjt++;
            }
        }
        if(s45==10)
        {
            if(qian<150000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=150000;
                eg+=800000;
                gmcs--;
                xzj++;
            }
        }
        if(s45==11)
        {
            if(qian<400000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=400000;
                ex+=3000000;
                gmcs--;
                xzt++;
            }
        }
        if(s45==12)
        {
            if(qian<400000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=400000;
                eg+=2000000;
                gmcs--;
                xhj++;
            }
        }
        if(s45==13)
        {
            if(qian<10000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=10000;
                xhxy++;
                gmcs--;
            }
        }
        if(s45==14)
        {
            if(qian<10000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=10000;
                xzd++;
                gmcs--;
            }
        }
        if(s45==15)
        {
            if(qian<1000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=1000000;
                ex+=8000000;
                gmcs--;
                zpt++;
            }
        }
        if(s45==16)
        {
            if(qian<1000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=1000000;
                eg+=6000000;
                gmcs--;
                zmj++;
            }
        }
        if(s45==17)
        {
            if(qian<2500000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=2500000;
                ex+=20000000;
                gmcs--;
                zmt++;
            }
        }
        if(s45==18)
        {
            if(qian<2500000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=2500000;
                eg+=15000000;
                gmcs--;
                zsj++;
            }
        }
        if(s45==19)
        {
            if(qian<70000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=7000000;
                ex+=50000000;
                gmcs--;
                zst++;
            }
        }
        if(s45==20)
        {
            if(qian<7000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=7000000;
                eg+=40000000;
                gmcs--;
                ztj++;
            }
        }
        if(s45==21)
        {
            if(qian<20000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=20000000;
                ex+=120000000;
                gmcs--;
                ztt++;
            }
        }
        if(s45==22)
        {
            if(qian<20000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=20000000;
                eg+=100000000;
                gmcs--;
                zjj++;
            }
        }
        if(s45==23)
        {
            if(qian<50000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=50000000;
                ex+=300000000;
                gmcs--;
                zjt++;
            }
        }
        if(s45==24)
        {
            if(qian<50000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=50000000;
                eg+=250000000;
                gmcs--;
                zzj++;
            }
        }
        if(s45==25)
        {
            if(qian<120000000)cout<<"没钱就不要买了"<<endl;
            else
            {
                cout<<"购买成功"<<endl;
                qian-=120000000;
                ex+=800000000;
                gmcs--;
                zzt++;
            }
        }
        if(s45==26)
        {
            if(qian<120000000)cout<<"没钱就不要买了"<<endl;
            else
            {   
                cout<<"购买成功"<<endl;
                qian-=120000000;
                eg+=600000000;
                gmcs--;
                zhj++;
            }
        }
        if(s45==27)
        {
            if(zs<5)cout<<"没钱就不要买了"<<endl;
            else
            {   
                cout<<"购买成功"<<endl;
                zs-=5;
                ex+=2000000000;
                gmcs--;
                dpt++;
            }
        }
        if(s45==28)
        {
            if(zs<5)cout<<"没钱就不要买了"<<endl;
            else
            {   
                cout<<"购买成功"<<endl;
                zs-=5;
                eg+=1600000000;
                gmcs--;
                dmj++;
            }
        }
        if(s45==29)
        {
            if(zs<12)cout<<"没钱就不要买了"<<endl;
            else
            {   
                cout<<"购买成功"<<endl;
                zs-=12;
                ex+=5200000000;
                gmcs--;
                dmt++;
            }
        }
        if(s45==30)
        {
            if(zs<12)cout<<"没钱就不要买了"<<endl;
            else
            {   
                cout<<"购买成功"<<endl;
                zs-=12;
                eg+=4500000000;
                gmcs--;
                dsj++;
            }
        }
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s45;
    cf();       
}
int yr()
{
    cout<<"1区 修建火车站"<<endl;
    cout<<"2区 修建地铁站"<<endl;
    int s50,s51;
    cin>>s50;
    if(s50==1)
    {
        cout<<"修建火车站需800亿金币 可以获得大量奖励"<<endl;
        cout<<"奖励：3次抽奖机会 2次购买机会 血量攻击力各加2亿 信誉度加10"<<endl;
        cout<<"1键确定修建"<<endl;
        cin>>s51;
        if(s51==1)
        {
            if(qian<80000000000)cout<<"你的钱不够哟"<<endl;
            else
            {
                qian-=80000000000;
                cjcs+=3;
                gmcs+=2;
                xyd+=10;
                eg+=100000000;
                ex+=100000000;
                cout<<"修建成功"<<endl; 
            } 
        }
    }
    if(s50==2)
    {
        cout<<"修建地铁站需5000亿金币 可以获得大量奖励"<<endl;
        cout<<"奖励：7次抽奖机会 5次购买机会 血量攻击力各加12亿 信誉度加100 额外福利：投资指数+5"<<endl;
        cout<<"1键确定修建"<<endl;
        cin>>s51;
        if(s51==1)
        {
            if(qian<500000000000)cout<<"你的钱不够哟"<<endl;
            else
            {
                qian-=500000000000;
                cjcs+=7;
                gmcs+=5;
                xyd+=100;
                eg+=1200000000;
                ex+=1200000000;
                tzzs+=5; 
                cout<<"修建成功"<<endl; 
            } 
        }
    }
    cout<<"任意键退出"<<endl;
    cin>>s50;
    cf();
}
int hh()
{
    cout<<"1区 钻石换金币"<<endl;
    int s48;
    long long s49;
    cin>>s48;
    if(s48==1)
    {
        cout<<"1钻石=1亿金币"<<endl; 
        cout<<"请输入你要换的钻石数量"<<endl;
        cin>>s49;
        if(s49>zs)cout<<"你的钻石数量不够"<<endl;
        else
        {
            cout<<"转换成功"<<endl;
            zs-=s49;
            qian+=s49*100000000; 
        } 
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s48;
    cf(); 
}
int jq()
{
    cout<<"1.借钱 2.还钱"<<endl;
    long long s49,s50;
    cin>>s49;
    if(s49==1)
    {
        if(qq>=1)cout<<"请先归还应该归还的金币再借"<<endl;
        else
        {
            cout<<"你最多可以借"<<xyd*100000000<<"金币"<<endl; 
            cout<<"你最少可以借"<<xyd*10000000<<"金币"<<endl; 
            cout<<"请输入你要借钱的数量"<<endl;
            cin>>s50;
            if(s50>xyd*100000000)cout<<"你的信誉度太低了 借不到这么多金币"<<endl;
            if(s50<xyd*10000000)cout<<"你不能只借怎么点金币"<<endl; 
            if(s50<=xyd*100000000&&s50>=xyd*10000000)
            {
                cout<<"借款成功 记得要双倍归还哟"<<endl;
                qq=s50;
                qian+=s50;
            }
        }   
    }
    if(s49==2)
    {
        if(qq==0)cout<<"目前你没有要还的金币"<<endl;
        if(qq>=1)
        {
            cout<<"你有一笔"<<qq*2<<"的金币要还"<<endl;
            cout<<"1键归还"<<endl;
            cin>>s50;
            if(s50==1)
            {
                if(qian<qq*2)cout<<"你目前的金币还不够还"<<endl;
                else
                {
                    cout<<"还钱成功"<<endl;
                    qian-=qq*2;
                    qq=0; 
                    xyd++;
                } 
            } 
        } 
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s49;
    cf(); 
} 
int cj()
{
    int s46;
    cout<<"1.普通抽奖 2.钻石抽奖"<<endl; 
    cin>>s46;
    if(s46==1)
    {
        int s47;
        if(cjcs<=0)cout<<"抽奖次数已经用完"<<endl;
        else
        {
            cout<<"奖项如下"<<endl; 
            cout<<"1.10钻石 几率：4%"<<endl;
            cout<<"2.1钻石 几率：30%"<<endl;
            cout<<"3.5亿金币 几率：6%"<<endl;
            cout<<"4.500万金币 几率：40%"<<endl;
            cout<<"5.购买次数2次 几率：20%"<<endl;
            cout<<"1键开始抽奖"<<endl; 
            cin>>s47;
            if(s47==1)
            {
                cjcs--;
                s47=rand()%100;
                if(s47>=0&&s47<=3)
                {
                    cout<<"恭喜你抽到了10钻石"<<endl;
                    zs+=10; 
                }
                if(s47>=4&&s47<=33)
                {
                    cout<<"恭喜你抽到了1钻石"<<endl;
                    zs+=1; 
                }
                if(s47>=34&&s47<=39)
                {
                    cout<<"恭喜你抽到了5亿金币"<<endl;
                    qian+=500000000; 
                }
                if(s47>=40&&s47<=79)
                {
                    cout<<"恭喜你抽到了500万金币"<<endl;
                    qian+=5000000;
                }
                if(s47>=80&&s47<=99)
                {
                    cout<<"恭喜你抽到了购买次数2次"<<endl;
                    gmcs+=2;
                }
            }
        }
    }
    if(s46==2)
    {
        int s48;
        if(zs<5)cout<<"你的钻石不足"<<endl;
        else
        {
            cout<<"奖项如下"<<endl;
            cout<<"1.购买次数5次 几率：20%"<<endl;
            cout<<"2.20亿金币 几率：8%"<<endl;
            cout<<"3.20钻石 几率：2%"<<endl;
            cout<<"4.3钻石 几率：30%"<<endl;
            cout<<"5.抽奖机会1次 几率：20%"<<endl;
            cout<<"6.攻击力和血量各加1亿 几率：20%"<<endl;
            cout<<"1键开始抽奖"<<endl;
            cin>>s48;
            if(s48==1)
            {
                zs-=5;
                s48=rand()%100;
                if(s48<=20)
                {
                    cout<<"恭喜你抽到了购买次数5次"<<endl;
                    gmcs+=5; 
                }
                if(s48>=21&&s48<=28)
                {
                    cout<<"恭喜你抽到了20亿金币"<<endl;
                    qian+=2000000000; 
                }   
                if(s48>=29&&s48<=30)
                {
                    cout<<"恭喜你抽到了20钻石"<<endl;
                    zs+=20; 
                }
                if(s48>=31&&s48<=60)
                {
                    cout<<"恭喜你抽到了3钻石"<<endl;
                    zs+=3; 
                }
                if(s48>=61&&s48<=80)
                {
                    cout<<"恭喜你抽到了抽奖次数1次"<<endl;
                    cjcs++; 
                }
                if(s48>=81)
                {
                    cout<<"恭喜你抽到了攻击力和血量各加1亿"<<endl;
                    eg+=100000000;
                    ex+=100000000; 
                }
            } 
        }
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s46;
    cf(); 
}
int bm()
{
    cout<<"1个钻石可以购买1次购买机会 1键确定"<<endl; 
    cout<<"10个钻石可以购买12次购买机会 2键确定"<<endl;
    cout<<"否则返回主菜单"<<endl; 
    int s46;
    cin>>s46;
    if(s46==1)
    {
        if(zs<1)cout<<"小朋友 没有钻石了"<<endl;
        else
        {
            zs--;
            gmcs++;
            cout<<"购买成功"<<endl; 
        } 
    }
    if(s46==2)
    {
        if(zs<10)cout<<"小朋友 没有钻石了"<<endl;
        else
        {
            zs-=10;
            gmcs+=12;
            cout<<"购买成功"<<endl; 
        } 
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s46;
    cf(); 
}
int bb()
{
    cout<<"===回血类==="<<endl;
    cout<<"小回血药水："<<xhxy<<endl;
    cout<<"===攻击类==="<<endl;
    cout<<"小炸弹："<<xzd<<endl;
    cout<<"===武器类==="<<endl;
    cout<<"小木剑："<<xmj<<endl;
    cout<<"小石剑："<<xsj<<endl;
    cout<<"小铁剑："<<xtj<<endl;
    cout<<"小金剑："<<xjj<<endl;
    cout<<"小钻剑："<<xzj<<endl;
    cout<<"小黑剑："<<xhj<<endl;
    cout<<"中木剑："<<zmj<<endl;
    cout<<"中石剑："<<zsj<<endl;
    cout<<"中铁剑："<<ztj<<endl;
    cout<<"中金剑："<<zjj<<endl;
    cout<<"中钻剑："<<zzj<<endl;
    cout<<"中黑剑："<<zhj<<endl;
    cout<<"大木剑："<<dmj<<endl;
    cout<<"大石剑："<<dsj<<endl;
    cout<<"任意键返回主菜单"<<endl;
    int s46;
    cin>>s46;
    cf(); 
} 
int em()
{
    if(emz>emsx)
    {
        cout<<"噩梦已打完"<<endl; 
    }
    if(emz<=emsx)
    {
        cout<<"即将挑战第"<<emz<<"关"<<endl;
        cout<<"1键开始 否则返回主菜单"<<endl; 
        int s22;
        cin>>s22;
        if(s22==1)
        {
            cout<<"挑战开始"<<endl;
            tzdz=emg[emz]*2;
            cout<<"怪的攻击力为"<<emg[emz]<<endl;
            cout<<"怪的血量为"<<emx[emz]<<endl;
            ggg=emg[emz];
            ggx=emx[emz];
            for(int i=1;;)
            {
                int ssss=rand()%10; 
                if(ssss==2&&ttgznz>=1&&js==4)
                {
                    cout<<"技能：特工之怒对怪照成了"<<ttgzng[ttgznz] <<"点伤害"<<endl;
                    ggx-=ttgzng[ttgznz];
                }
                if(ssss==8&&xswzrz>=1&&js==1)
                {
                    cout<<"技能：死亡之刃对怪照成了"<<xswzrg[xswzrz]<<"点伤害"<<endl;
                    ggx-=xswzrg[xswzrz];
                }
                if(ssss==6&&btlshz>=1&&js==3)
                {
                    cout<<"技能：跳楼伤害对怪照成了"<<btlshg[btlshz]<<"点伤害"<<endl;
                    ggx-=btlshg[btlshz];
                }
                if(xzd>=1)
                {
                    cout<<"小炸弹对怪照成了100000点伤害"<<endl; 
                    ggx-=100000;
                    xzd--;
                }
                cout<<"你对怪照成了"<<g<<"点伤害"<<endl; 
                ggx-=g;
                if(ggx<=0)
                {
                    win=1;
                    break;
                }
                cout<<"怪对你照成了"<<ggg<<"点伤害"<<endl;
                x-=ggg;
                if(x<=0)
                {
                    win=0;
                    break;
                }
                if(ssss==7&&yhxzlz>=1&&js==2)
                {
                    cout<<"技能：回血之露给你回了"<<yhxzlx[yhxzlz]<<"滴血"<<endl; 
                    x+=yhxzlx[yhxzlz];
                }
                if(xhxy>0)
                {
                    x+=100000;
                    xhxy--;
                    cout<<"小回血药水给你回了100000滴血"<<endl; 
                }
            } 
            if(win==1)
            {
                cout<<"你胜利了"<<endl;
                cout<<"你获得了"<<tzdz<<"金币"<<endl;
                cout<<"你获得了1次抽奖次数"<<endl;
                cjcs++;
                qian+=tzdz;
                emz++; 
            }
            else
            {
                cout<<"你失败了"<<endl;
                cout<<"你失去了"<<tzdz<<"金币"<<endl;
                qian-=tzdz;
            }
        }   
    }
    cout<<"任意键返回主菜单"<<endl;
    int s23;
    cin>>s23;
    cf(); 
} 
int zc()
{
    cout<<"请选择你要投资的项目"<<endl;
    cout<<"1.怪兽公司"<<endl;
    cout<<"2.老李公司"<<endl;
    cout<<"3.有钱人家公司"<<endl; 
    cout<<"4.超坑公司"<<endl; 
    cout<<"否则返回主菜单"<<endl;
    long long s43,s44;
    cin>>s43;
    if(s43==1)
    {
        cout<<"请输入你投资的金额"<<endl;
        cin>>s44;
        if(s44>qian)cout<<"小朋友 量力而行哟"<<endl; 
        if(s44<100000&&qian>=s44)cout<<"太没诚意了吧"<<endl;
        if(s44>100000000000&&qian>=s44)cout<<"土豪 钱太多了 塞不下"<<endl; 
        if(s44>=100000&&s44<=100000000000&&qian>=s44)
        {
            cout<<"放钱中......"<<endl;
            cout<<"计算回报中......"<<endl;
            s44=rand()%5/2*s44*tzzs-s44;
            cout<<"得到回报"<<s44<<"金币"<<endl;
            tzzs+=0.1;
            qian+=s44;
        }
    } 
    if(s43==2)
    {
        cout<<"请输入你投资的金额"<<endl;
        cin>>s44;
        if(s44>qian)cout<<"小朋友 量力而行哟"<<endl; 
        if(s44<1000000&&qian>=s44)cout<<"太没诚意了吧"<<endl;
        if(s44>10000000000000&&qian>=s44)cout<<"土豪 钱太多了 塞不下"<<endl; 
        if(s44>=1000000&&s44<=1000000000000000&&qian>=s44)
        {
            cout<<"放钱中......"<<endl;
            cout<<"计算回报中......"<<endl;
            s44=rand()%6/2*s44*tzzs-s44;
            cout<<"得到回报"<<s44<<"金币"<<endl;
            tzzs+=0.1;
            qian+=s44;
        }
    } 
    if(s43==3)
    {
        cout<<"请输入你投资的金额"<<endl;
        cin>>s44;
        if(s44>qian)cout<<"小朋友 量力而行哟"<<endl; 
        if(s44<10000000&&qian>=s44)cout<<"太没诚意了吧"<<endl;
        if(s44>10000000000000000&&qian>=s44)cout<<"土豪 钱太多了 塞不下"<<endl; 
        if(s44>=10000000&&s44<=100000000000000000&&qian>=s44)
        {
            cout<<"放钱中......"<<endl;
            cout<<"计算回报中......"<<endl;
            s44=rand()%8/2*s44*tzzs-s44;
            cout<<"得到回报"<<s44<<"金币"<<endl;
            tzzs+=0.1;
            qian+=s44;
        }
    } 
    if(s43==4)
    {
        cout<<"请输入你投资的金额"<<endl;
        cin>>s44;
        if(s44>qian)cout<<"小朋友 量力而行哟"<<endl; 
        if(s44<0&&qian>=s44)cout<<"太没诚意了吧"<<endl;
        if(s44>1000000000000000000&&qian>=s44)cout<<"土豪 钱太多了 塞不下"<<endl; 
        if(s44>=0&&s44<=1000000000000000000&&qian>=s44)
        {
            cout<<"放钱中......"<<endl;
            cout<<"计算回报中......"<<endl;
            int s22;
            s22=rand()%2;
            if(s22==0)
            {
                cout<<"你大亏了,亏了"<<s44*20<<"金币"<<endl;
                qian=qian-s44*20;
            }
            else
            {
                cout<<"你大赚了，赚了"<<s44*20<<"金币"<<endl;
                qian=qian+s44*20;
            }
            tzzs+=0.1;
        }
    } 
    cout<<"任意键返回主菜单"<<endl;
    cin>>s43; 
    cf();
} 
int wl()
{
    cout<<"1区 狂输赚钱"<<endl; 
    cout<<"2区 我闲着呢"<<endl;
    cout<<"3区 简单答题"<<endl; 
    cout<<"4区 输入奇数"<<endl; 
    int s34;
    cin>>s34;
    if(s34==1)
    {
        cout<<"赚钱规则：你可以无限制的输入1，每输入一次赚30金币，当你输入其他数字代表你不想继续了"<<endl;
        int s35;
        cout<<"开始"<<endl; 
        for(;;)
        {
            cin>>s35;
            if(s35==1)qian+=30;
            else break;
        }
    }
    if(s34==2)
    {
        cout<<"赚钱规则：你输入一个数n，然后输入n个数，就可以得到n*15金币"<<endl;
        int s36,s37;
        cout<<"开始"<<endl;
        cin>>s36;
        for(int i=1;i<=s36;i++) 
        {
            cin>>s37;
            qian+=15;
        }
    }
    if(s34==3)
    {
        cout<<"赚钱规则：给你两个数，计算它们的和，答对得500金币，打错扣500金币"<<endl;
        int s38=rand()%100,s39=rand()%100,s40; 
        cout<<"开始"<<endl;
        cout<<endl<<endl;
        cout<<"给你的数为"<<s38<<"和"<<s39<<endl;
        cin>>s40;
        if(s40==s38+s39)qian+=500;
        else qian-=500;
    }
    if(s34==4)
    {
        cout<<"赚钱规则：你可以无限制输入，当输入奇数时，得到40金币，否则返回主菜单"<<endl;
        int s41;
        cout<<"开始"<<endl;
        for(;;)
        {
            cin>>s41;
            if(s41%2==1)qian+=40;
            else break;
        }
    }
    cout<<"任意键返回主菜单"<<endl; 
    cin>>s34;
    cf();
}
int bt()
{
    cout<<"请输入20个1并且花费100金币和3体力值即可补充5体力"<<endl;
    cout<<"输入20个1键开始 否则返回主菜单"<<endl; 
    int s33;
    for(int i=1;i<=20;i++)
    {
        cin>>s33;
        if(s33!=1)break;
        if(i==20)
        {
            if(qian<100)cout<<"你的金币不足"<<endl;
            if(tl<3)cout<<"你的体力不足"<<endl;
            if(tl>=3&&qian>=100)
            {
                cout<<"体力值补充成功"<<endl;
                qian=qian-100;
                tl=tl-3;
                tl=tl+5; 
            } 
        }
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s33;
    cf();
}
int zq()
{
    cout<<"A区      1键进入"<<endl;
    cout<<"B区      2键进入"<<endl;
    cout<<"C区      3键进入"<<endl;
    int s24;
    cin>>s24;
    if(s24==1)
    {
        cout<<"1.搬家具"<<endl;
        cout<<"2.搬砖"<<endl;
        int s25;
        cin>>s25;
        if(s25==1)
        {
            cout<<"严厉的老板：搬家具给5000金币"<<endl;
            cout<<"搬家具要花费10点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s26;
            cin>>s26;
            if(s26==1)
            {
                if(tl<10)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=10;
                    qian+=5000;
                    cout<<"搬家具得到了5000金币"<<endl;
                }
            }
        } 
        if(s25==2)
        {
            cout<<"帅气的老板：搬砖给2000金币和1点勇气"<<endl;
            cout<<"搬砖要花费5点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s27;
            cin>>s27;
            if(s27==1)
            {
                if(tl<5)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=5;
                    qian+=2000;
                    yq++;
                    cout<<"搬砖得到了2000金币和1勇气"<<endl;
                }
            }
        }
    }
    if(s24==2)
    {
        cout<<"1.帮忙宣传 2.帮忙采购"<<endl; 
        int s30;
        cin>>s30;
        if(s30==1)
        {
            cout<<"和蔼的老板：帮忙宣传给4200和1勇气值金币"<<endl;
            cout<<"帮忙宣传要花费10点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s31;
            cin>>s31;
            if(s31==1)
            {
                if(tl<10)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=10;
                    qian+=4200;
                    yq++;
                    cout<<"帮忙宣传得到了4200金币和1点勇气值"<<endl;
                }
            }
        }
        if(s30==2)
        {
            cout<<"帅气的老板：帮忙采购给12000金币"<<endl;
            cout<<"帮忙采购要花费20点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s32;
            cin>>s32;
            if(s32==1)
            {
                if(tl<20)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=20;
                    qian+=12000;
                    cout<<"帮忙采购得到了12000金币"<<endl;
                }

            }
        }  
    }
    if(s24==3)
    {
        cout<<"1.捡钱"<<endl;
        cout<<"2.捡破烂"<<endl;
        int s25;
        cin>>s25;
        if(s25==1)
        {
            cout<<"我对自己说：捡钱可以获得1000金币"<<endl;
            cout<<"搬家具要花费1点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s26;
            cin>>s26;
            if(s26==1)
            {
                if(tl<1)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=1;
                    qian+=1000;
                    cout<<"捡钱得到了1000金币"<<endl;
                }
            }
        } 
        if(s25==2)
        {
            cout<<"收废品的老板：捡破烂得2000金币"<<endl;
            cout<<"搬砖要花费2点体力"<<endl;
            cout<<"1键确定 否则返回主菜单"<<endl;
            int s27;
            cin>>s27;
            if(s27==1)
            {
                if(tl<2)cout<<"你的体力不足"<<endl;
                else
                {
                    tl-=2;
                    qian+=2000;
                    yq++;
                    cout<<"捡破烂得到了2000金币"<<endl;
                }
            }
        }
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s24;
    cf();
}
int tz()
{
    if(tzz>tzsx)
    {
        cout<<"挑战已打完"<<endl; 
    }
    if(tzz<=tzsx)
    {
        cout<<"即将挑战第"<<tzz<<"关"<<endl;
        cout<<"1键开始 否则返回主菜单"<<endl; 
        int s22;
        cin>>s22;
        if(s22==1)
        {
            cout<<"挑战开始"<<endl;
            tzdz=tzgg[tzz]/2;
            cout<<"怪的攻击力为"<<tzgg[tzz]<<endl;
            cout<<"怪的血量为"<<tzgx[tzz]<<endl;
            int ggg=tzgg[tzz];
            int ggx=tzgx[tzz];
            for(int i=1;;)
            {
                int ssss=rand()%10; 
                if(ssss==2&&ttgznz>=1&&js==4)
                {
                    cout<<"技能：特工之怒对怪照成了"<<ttgzng[ttgznz] <<"点伤害"<<endl;
                    ggx-=ttgzng[ttgznz];
                }
                if(ssss==8&&xswzrz>=1&&js==1)
                {
                    cout<<"技能：死亡之刃对怪照成了"<<xswzrg[xswzrz]<<"点伤害"<<endl;
                    ggx-=xswzrg[xswzrz];
                }
                if(ssss==6&&btlshz>=1&&js==3)
                {
                    cout<<"技能：跳楼伤害对怪照成了"<<btlshg[btlshz]<<"点伤害"<<endl;
                    ggx-=btlshg[btlshz];
                }
                if(xzd>0)
                {
                    cout<<"小炸弹对怪照成了100000点伤害"<<endl; 
                    ggx-=100000;
                    xzd--;
                }
                cout<<"你对怪照成了"<<g<<"点伤害"<<endl; 
                ggx-=g;
                if(ggx<=0)
                {
                    win=1;
                    break;
                }
                cout<<"怪对你照成了"<<ggg<<"点伤害"<<endl;
                x-=ggg;
                if(x<=0)
                {
                    win=0;
                    break;
                }
                if(ssss==7&&yhxzlz>=1&&js==2)
                {
                    cout<<"技能：回血之露给你回了"<<yhxzlx[yhxzlz]<<"滴血"<<endl; 
                    x+=yhxzlx[yhxzlz];
                }
                if(xhxy>0)
                {
                    x+=100000;
                    xhxy--;
                    cout<<"小回血药水给你回了100000滴血"<<endl; 
                }

            }   
            if(win==1)
            {
                cout<<"你胜利了"<<endl;
                cout<<"你获得了"<<tzdz<<"金币"<<endl;
                qian+=tzdz;
                tzz++; 
            }   
            else
            {
                cout<<"你失败了"<<endl;
                cout<<"你失去了"<<tzdz<<"金币"<<endl;
                qian-=tzdz;
            }
        }   
    }
    cout<<"任意键返回主菜单"<<endl;
    int s23;
    cin>>s23;
    cf(); 
}
int by()
{
    cout<<"1000金币1勇气值"<<endl;
    cout<<"输入1买 否则退出"<<endl;
    int s21;
    cin>>s21;
    if(s21==1)
    {
        cout<<"请输入数量"<<endl;
        int sll;
        cin>>sll;
        cout<<"购买成功"<<endl;
        qian=qian-1000*sll;
        yq+=sll; 
    }
    cout<<"任意键返回主菜单"<<endl;
    int s22;
    cin>>s22;
    cf(); 
} 

int jn()
{
    if(js==1)
    {
        cout<<"x(大中小老等)的技能" <<endl; 
        cout<<"技能名：死亡之刃"<<"              "<<"学习程度："<<xswzrz<<endl;
        cout<<"技能介绍：每次攻击时有几率对怪照成一定伤害"<<endl;
        cout<<"升级（学习）该技能需要花费"<<jnq[xswzrz]<<"金币"<<endl;
        cout<<"1键确认"<<endl;
        int s18;
        cin>>s18;
        system("cls");
        if(s18==1)
        {
            if(qian<jnq[xswzrz])cout<<"你的金币不够"<<endl;
            else
            {
                qian=qian-jnq[xswzrz];
                cout<<"技能升级（学习）成功"<<endl; 
                xswzrz++;
            }
        }
    }
    if(js==2)
    {
        cout<<"y(大中小老等)的技能" <<endl; 
        cout<<"技能名：回血之露"<<"              "<<"学习程度："<<yhxzlz<<endl;
        cout<<"技能介绍：每次被攻击有几率回复一定血量"<<endl;
        cout<<"升级（学习）该技能需要花费"<<jnq[yhxzlz]<<"金币"<<endl;
        cout<<"1键确认"<<endl;
        int s19;
        cin>>s19;
        system("cls");
        if(s19==1)
        {
            if(qian<jnq[yhxzlz])cout<<"你的金币不够"<<endl;
            else
            {
                qian=qian-jnq[yhxzlz];
                cout<<"技能升级（学习）成功"<<endl; 
                yhxzlz++;
            }
        }
    }
    if(js==3)
    {
        cout<<"牛B(大中小老等)的技能" <<endl; 
        cout<<"技能名：跳楼伤害"<<"              "<<"学习程度："<<btlshz<<endl;
        cout<<"技能介绍：每次攻击都有一定几率照成大量伤害"<<endl;
        cout<<"升级（学习）该技能需要花费"<<jnq[btlshz]<<"金币"<<endl;
        cout<<"1键确认"<<endl;
        int s34;
        cin>>s34;
        system("cls");
        if(s34==1)
        {
            if(qian<jnq[btlshz])cout<<"你的金币不够"<<endl;
            else
            {
                qian=qian-jnq[btlshz];
                cout<<"技能升级（学习）成功"<<endl; 
                btlshz++;
            }
        }
    }
    if(js==4)
    {
        cout<<"特工007(大中小老等)的技能" <<endl; 
        cout<<"技能名：特工之怒"<<"              "<<"学习程度："<<ttgznz<<endl;
        cout<<"技能介绍：每次攻击有几率对怪照成大量伤害"<<endl;
        cout<<"升级（学习）该技能需要花费"<<jnq[ttgznz]<<"金币"<<endl;
        cout<<"1键确认"<<endl;
        int s20;
        cin>>s20;
        system("cls");
        if(s20==1)
        {
            if(qian<jnq[ttgznz])cout<<"你的金币不够"<<endl;
            else
            {
                qian=qian-jnq[ttgznz];
                cout<<"技能升级（学习）成功"<<endl; 
                ttgznz++;
            }
        }
    }
    cout<<"任意键返回主菜单"<<endl;
        int s19;
        cin>>s19;
        cf();
}
int tt()
{
    if(ddd/5>=lll)
    {
        cout<<"本次升头衔需要"<<txq[lll]<<"金币"<<endl;
        cout<<"1键确定 否则返回主菜单"<<endl; 
        int s13;
        cin>>s13;
        if(s13==1)
        {
            if(qian<=txq[lll])cout<<"你的金币不足"<<endl; 
            else
            {
                cout<<"升头衔成功"<<endl;
                qian=qian-txq[lll];
                lll++; 
            } 
        }
    }
    else 
    {
        cout<<"请你的阶数达到"<<lll*5<<"再来吧"<<endl;    
    }
    cout<<"任意键返回主菜单"<<endl;
    int s14;
    cin>>s14; 
    cf();
}
int jj()
{
    if(ddd>=jjsx)
    {
        cout<<"你的阶数已满"<<endl; 
    }
    else
    {
        cout<<"本次进阶需要"<<sjq[ddd]<<"金币"<<endl;
        cout<<"0键确定 否则返回主菜单"<<endl;
        int s11;
        cin>>s11;
        if(s11==0)
        {
            if(qian>=sjq[ddd])
            {
                qian=qian-sjq[ddd];
                ddd++; 
                cout<<"升阶成功"<<endl;
            }
            else cout<<"你的金币不足"<<endl; 
        }
    } 
    cout<<"任意键返回主菜单"<<endl;
    int s16;
    cin>>s16;
    cf();
}
int rw()
{
    cout<<"人物表"<<endl;
    cout<<"输入序号查看人物"<<endl;
    cout<<"1.小x"<<endl;
    cout<<"2.小y"<<endl;
    cout<<"3.小牛B"<<endl; 
    cout<<"4.小特工007"<<endl; 
    int s12,s13;
    cin>>s12;
    system("cls");
    if(s12==1)
    {
        cout<<"人物：小x"<<endl;
        cout<<"小x的话：我天生血就不是很高，攻击力也不强，都是我的爸爸大x把我的高攻击力打出来了"<<endl; 
        cout<<"攻击力评价:85分"<<endl;
        cout<<"血量评价:55分"<<endl;
        cout<<"装逼评价:33分"<<endl;
        cout<<"总评价:63分"<<endl;
        cout<<endl<<endl<<endl;
    }
    if(s12==2)
    {
        cout<<"人物：小y"<<endl;
        cout<<"小y的话：我是一个小肉盾，不过攻击力差强人意，我5阶之后就和我哥大y一样厉害了"<<endl; 
        cout<<"攻击力评价:60分"<<endl;
        cout<<"血量评价:81分"<<endl;
        cout<<"装逼评价:37分"<<endl;
        cout<<"总评价:61分"<<endl;
        cout<<endl<<endl<<endl;
    }
    if(s12==3)
    {
        cout<<"人物：小牛B"<<endl;
        cout<<"小牛B的话：我一刀斩下去，附带一个蛇皮走位，哈哈，我就是这么装逼"<<endl; 
        cout<<"攻击力评价:73分"<<endl;
        cout<<"血量评价:71分"<<endl;
        cout<<"装逼评价:69分"<<endl;
        cout<<"总评价:71分"<<endl;
        cout<<endl<<endl<<endl;
    }
    if(s12==4)
    {
        cout<<"人物：小特工007"<<endl;
        cout<<"小特工007的话：不要惹我哟，我一拳打死你，血量就先不提了"<<endl; 
        cout<<"攻击力评价:95分"<<endl;
        cout<<"血量评价:24分"<<endl;
        cout<<"装逼评价:75分"<<endl;
        cout<<"总评价:71分"<<endl;
        cout<<endl<<endl<<endl;
        cout<<"按1键返回主菜单"<<endl;
    }
    cout<<"任意键返回主菜单"<<endl;
    cin>>s12;
    cf(); 
}
int cm()
{
    win=0;
    if(sum>gksx)
    {
        cout<<"关卡打完了"<<endl; 
    }
    if(yq<=0)
    {
        cout<<"你的勇气值不足"<<endl; 
    }
    if(sum<=gksx&&yq>=200&&sum==100)
    {
        cout<<"经过99关的磨练"<<endl;
        cout<<"你终于可以来打藏在第100关的超级BOSS了"<<endl;
        cout<<"为了防止BOSS的脱装技能让你失去能力"<<endl;
        cout<<"一个神秘人特意给你准备了一把圣剑和一套无敌血装"<<endl;
        cout<<"BOSS快出来了"<<endl;
        start=clock();
        while(clock()-start<=5000);
        cout<<"哈哈哈哈"<<endl;
        cout<<"鸭子咕咕！脱装"<<endl;
        g-=eg;
        x-=ex;
        cout<<"鸭子咕咕！死亡之火"<<endl;
        cout<<"咚咚咚…"<<endl;
        cout<<"开始了！哈哈哈哈"<<endl;
        cout<<"圣剑给你加了3亿攻击力，无敌血装给你加了80亿血"<<endl;
        cout<<"BOSS的技能预览"<<endl;
        cout<<"1.死亡之火，攻击力5亿，多个攻击单位，释放几率5%"<<endl;
        cout<<"2.无敌回血，加5亿血，每个回合前释放"<<endl;
        cout<<"3.义气之魂，加5000万攻击力，释放几率15%"<<endl;
        cout<<"4.炼狱之剑，攻击力20亿，单个攻击单位，释放几率4%"<<endl;
        cout<<"5.<终极大招>无敌吸血，攻击力50亿，加50亿血，释放几率1%"<<endl;
        cout<<"BOSS初始血量为666，攻击力为1亿"<<endl;
        cout<<"战斗即将开始…"<<endl;
        g+=300000000;
        x+=8000000000;
        ggg=100000000;
        ggx=666666666;
        int s60;
        start=clock();
        while(clock()-start<=5000); 
        while(true)
        {
            cout<<"BOSS还剩"<<ggx<<"滴血"<<endl;
            cout<<"BOSS当前战斗力为"<<ggg<<endl;
            cout<<"你的血量还剩"<<x<<endl;
            cout<<"你的攻击力为"<<g<<endl;
            cout<<"BOSS的技能：无敌回血给BOSS加了5亿滴血"<<endl;
            ggx+=500000000;
            s60=rand()%100;
            if(s60>=0&&s60<=4)
            {
                cout<<"BOSS的技能：死亡之火对你照成了5亿点伤害"<<endl;
                x-=500000000;
            }
            if(s60>=5&&s60<=19)
            {
                cout<<"BOSS的技能：义气之魂给BOSS加了5000万点伤害"<<endl;
                ggg+=50000000;
            }
            if(s60>=20&&s60<=23)
            {
                cout<<"BOSS的技能：炼狱之剑给你照成了20亿伤害"<<endl;
                x-=2000000000;
            }
            if(s60==66)
            {
                cout<<"BOSS的终极大招：无敌吸血把你的50亿血吸到了他身上"<<endl;
                ggx+=5000000000;
                x-=5000000000;
            }
            cout<<"BOSS对你照成了"<<ggg<<"点伤害"<<endl;
            x-=ggg;
            if(x<=0)
            {
                cout<<"你失败了"<<endl;
                cout<<"你失去了200点勇气值"<<endl;
                yq-=200;
                cout<<"即将返回主菜单"<<endl;
                start=clock();
                while(clock()-start<=3000);
                cj();
                return 0; 
            }
            cout<<"你的无敌血装给你回了2亿滴血"<<endl;
            x+=200000000;
            cout<<"你对BOSS照成了"<<g<<"点伤害"<<endl;
            ggx-=g;
            if(g<=0)
            {
                cout<<"你胜利了"<<endl;
                cout<<"你获得了10钻石和开启下一百关的钥匙"<<endl;
                zs+=10;
                cout<<"即将返回主界面"<<endl;
                start=clock();
                while(clock()-start<=3000);
                cf();
                return 0; 
            }
        }
    }
    if(sum<=gksx&&yq>=1&&sum!=100)
    {
        cout<<"即将挑战第"<<sum<<"关"<<endl;
        cout<<"怪的攻击力为"<<gg[sum]<<endl;
        cout<<"怪的血量为"<<gx[sum]<<endl;
        int ggg=gg[sum];
        int ggx=gx[sum];
        int b5ggg;
        int b5ggx;
        if(sum%5==0)
        {
            b5ggg=b5gg[sum/5]*10;
            b5ggx=b5gx[sum/5]*10;
            cout<<"BOSS攻击力为"<<b5gg[sum/5]*10<<endl;
            cout<<"BOSS血量为"<<b5gx[sum/5]*10<<endl; 
        }
        cout<<"挑战开始"<<endl;
        if(sum%5!=0)
        {
            while(true)
            {
                int ssss=rand()%10;
                if(ssss==2&&ttgznz>=1&&js==4)
                {
                    cout<<"技能：特工之怒对怪照成了"<<ttgzng[ttgznz] <<"点伤害"<<endl;
                    ggx-=ttgzng[ttgznz];
                }
                if(ssss==8&&xswzrz>=1&&js==1)
                {
                    cout<<"技能：死亡之刃对怪照成了"<<xswzrg[xswzrz]<<"点伤害"<<endl;
                    ggx-=xswzrg[xswzrz];
                }
                if(ssss==6&&btlshz>=1&&js==3)
                {
                    cout<<"技能：跳楼伤害对怪照成了"<<btlshg[btlshz]<<"点伤害"<<endl;
                    ggx-=btlshg[btlshz];
                }
                if(xzd>0)
                {
                    cout<<"小炸弹对怪照成了100000点伤害"<<endl; 
                    ggx-=100000;
                    xzd--;
                }
                cout<<"你对怪照成了"<<g<<"点伤害"<<endl; 
                ggx-=g;
                if(ggx<=0)
                {
                    win=1;
                    break;
                }
                cout<<"怪对你照成了"<<ggg<<"点伤害"<<endl;
                x-=ggg;
                if(x<=0)
                {
                    win=0;
                    break;
                }
                if(ssss==7&&yhxzlz>=1&&js==2)
                {
                    cout<<"技能：回血之露给你回了"<<yhxzlx[yhxzlz]<<"滴血"<<endl; 
                    x+=yhxzlx[yhxzlz];
                }
                if(xhxy>0)
                {
                    x+=1000;
                    xhxy--;
                    cout<<"小回血药水给你回了100000滴血"<<endl; 
                }
            }
        }
        else
        {
            while(true)
            {
                int ssss=rand()%10;
                if(ggx>0)
                {
                    if(ssss==2&&ttgznz>=1&&js==4)
                    {
                        cout<<"技能：特工之怒对怪照成了"<<ttgzng[ttgznz] <<"点伤害"<<endl;
                        ggx-=ttgzng[ttgznz];
                    }
                    if(ssss==8&&xswzrz>=1&&js==1)
                    {
                        cout<<"技能：死亡之刃对怪照成了"<<xswzrg[xswzrz]<<"点伤害"<<endl;
                        ggx-=xswzrg[xswzrz];
                    }
                    if(ssss==6&&btlshz>=1&&js==3)
                    {
                        cout<<"技能：跳楼伤害对怪照成了"<<btlshg[btlshz]<<"点伤害"<<endl;
                        ggx-=btlshg[btlshz];
                    }
                    if(xzd>0)
                    {
                        cout<<"小炸弹对怪照成了100000点伤害"<<endl; 
                        ggx-=100000;
                        xzd--;
                    }
                    cout<<"你对怪照成了"<<g<<"点伤害"<<endl; 
                    ggx-=g;
                }
                else if(b5ggx>0)
                {
                    if(ssss==2&&ttgznz>=1&&js==4)
                    {
                        cout<<"技能：特工之怒对BOSS照成了"<<ttgzng[ttgznz] <<"点伤害"<<endl;
                        b5ggx-=ttgzng[ttgznz];
                    }
                    if(ssss==8&&xswzrz>=1&&js==1)
                    {
                        cout<<"技能：死亡之刃对BOSS照成了"<<xswzrg[xswzrz]<<"点伤害"<<endl;
                        b5ggx-=xswzrg[xswzrz];
                    }
                    if(ssss==6&&btlshz>=1&&js==3)
                    {
                        cout<<"技能：跳楼伤害对BOSS照成了"<<btlshg[btlshz]<<"点伤害"<<endl;
                        b5ggx-=btlshg[btlshz];
                    }
                    if(xzd>0)
                    {
                        cout<<"小炸弹对BOSS照成了100000点伤害"<<endl; 
                        b5ggx-=100000;
                        xzd--;
                    }
                    cout<<"你对BOSS照成了"<<g<<"点伤害"<<endl; 
                    b5ggx-=g;
                }
                if(ggx<=0&&b5ggx<=0)
                {
                    win=1;
                    break;
                }
                if(ggx>0)
                {
                    cout<<"怪对你照成了"<<ggg<<"点伤害"<<endl;
                    x-=ggg;
                }
                if(b5ggx>0)
                {
                    cout<<"BOSS对你照成了"<<b5ggg<<"点伤害"<<endl;
                    x-=b5ggg;
                }
                if(x<=0)
                {
                    win=0;
                    break;
                }
                if(ssss==7&&yhxzlz>=1&&js==2)
                {
                    cout<<"技能：回血之露给你回了"<<yhxzlx[yhxzlz]<<"滴血"<<endl; 
                    x+=yhxzlx[yhxzlz];
                }
                if(xhxy>0)
                {
                    x+=1000;
                    xhxy--;
                    cout<<"小回血药水给你回了100000滴血"<<endl; 
                }
            }   
        }
        if(win==1)
        {
            cout<<"你胜利了"<<endl;
            cout<<"你获得了"<<gq[sum]<<"金币"<<endl;
            if(sum%10==0)
            {
                cout<<"你额外获得了1次抽奖机会"<<endl; 
                cjcs++;
            }
            qian+=gq[sum];
            sum++;
        }
        else
        {
            cout<<"你失败了"<<endl;
            cout<<"你失去了"<<"1"<<"勇气值"<<endl;
            yq-=1;
        }
    }
    cout<<"任意键返回主菜单"<<endl;
    int s17;
    cin>>s17;
    cf(); 
}
int xr()
{
    if(oo==0)cf();
    oo=0;
    cout<<"夏日猜猜猜游戏开始"<<endl;
    cout<<"共有3次猜的机会"<<endl;
    long long x=rand();
    x=x%100;
    for(int i=1;i<=3;i++)
    {
        cin>>yy;
        if(yy==x)rr=1;
    }
    if(rr==1)
    {
        cout<<"猜中了 获得1000000金币"<<endl;
        qian+=1000000;
    }
    else cout<<"猜错了"<<endl;
    cout<<"按0键返回主菜单"<<endl; 
    int x4;
    cin>>x4;
    if(x4==0)cf(); 
}
int lq()
{
    if(o>=0)
    {
        cout<<"领钱成功，领到100000金币";
        o--;
        qian=qian+100000; 
        cout<<"按非0键返回主界面"<<endl; 
        int ooooooo;
        cin>>ooooooo;
        if(ooooooo!=0)cf();
    }
    else 
    {
        cf();
    }
} 
int sj();
int cf()
{
    system("cls");
    if(js==1)
    {
        cout<<"用户名："<<yhm<<endl; 
        cout<<"角色："<<tx[lll]<<ss<<endl; 
        cout<<"攻击力："<<xg[d]*ddd*(lll*2-1)+eg<<endl;
        cout<<"血量："<<xx[d]*ddd*(lll*2-1)+ex<<endl; 
        cout<<"等级："<<d<<endl; 
        cout<<"金币："<<qian<<endl; 
        cout<<"钻石："<<zs<<endl; 
        cout<<"勇气值："<<yq<<endl; 
        cout<<"体力："<<tl<<endl;
        cout<<"阶数："<<ddd<<endl; 
        printf("投资指数：%.1lf\n",tzzs);
        cout<<"信誉度："<<xyd<<endl; 
        cout<<"购买次数："<<gmcs<<endl; 
        cout<<"抽奖次数："<<cjcs<<endl;
        x=xx[d]*pow(2,ddd/2)*pow(3,lll)+ex;
        g=xg[d]*pow(2,ddd/2)*pow(3,lll)+eg;
    }
    if(js==2)
    {
        cout<<"用户名："<<yhm<<endl; 
        cout<<"角色："<<tx[lll]<<ss<<endl; 
        cout<<"攻击力："<<yg[d]*ddd*(lll*2-1)+eg<<endl;
        cout<<"血量："<<yx[d]*ddd*(lll*2-1)+ex<<endl; 
        cout<<"等级："<<d<<endl; 
        cout<<"金币："<<qian<<endl; 
        cout<<"钻石："<<zs<<endl; 
        cout<<"勇气值："<<yq<<endl;
        cout<<"体力："<<tl<<endl; 
        cout<<"阶数："<<ddd<<endl; 
        printf("投资指数：%.1lf\n",tzzs);
        cout<<"信誉度："<<xyd<<endl; 
        cout<<"购买次数："<<gmcs<<endl; 
        cout<<"抽奖次数："<<cjcs<<endl;
        x=yx[d]*pow(2,ddd/2)*pow(3,lll)+ex;
        g=yg[d]*pow(2,ddd/2)*pow(3,lll)+eg;
    }
    if(js==3)
    {
        cout<<"用户名："<<yhm<<endl; 
        cout<<"角色："<<tx[lll]<<ss<<endl; 
        cout<<"攻击力："<<nbg[d]*ddd*(lll*2-1)+eg<<endl;
        cout<<"血量："<<nbx[d]*ddd*(lll*2-1)+ex<<endl; 
        cout<<"等级："<<d<<endl; 
        cout<<"金币："<<qian<<endl; 
        cout<<"钻石："<<zs<<endl; 
        cout<<"勇气值："<<yq<<endl;
        cout<<"体力："<<tl<<endl; 
        cout<<"阶数："<<ddd<<endl; 
        printf("投资指数：%.1lf\n",tzzs);
        cout<<"信誉度："<<xyd<<endl; 
        cout<<"购买次数："<<gmcs<<endl; 
        cout<<"抽奖次数："<<cjcs<<endl;
        x=nbx[d]*pow(2,ddd/2)*pow(3,lll)+ex;
        g=nbg[d]*pow(2,ddd/2)*pow(3,lll)+eg;
    }
    if(js==4)
    {
        cout<<"用户名："<<yhm<<endl; 
        cout<<"角色："<<tx[lll]<<ss<<endl; 
        cout<<"攻击力："<<t7g[d]*ddd*(lll*2-1)+eg<<endl;
        cout<<"血量："<<t7x[d]*ddd*(lll*2-1)+ex<<endl; 
        cout<<"等级："<<d<<endl; 
        cout<<"金币："<<qian<<endl; 
        cout<<"钻石："<<zs<<endl; 
        cout<<"勇气值："<<yq<<endl; 
        cout<<"体力："<<tl<<endl;
        cout<<"阶数："<<ddd<<endl; 
        printf("投资指数：%.1lf\n",tzzs);
        cout<<"信誉度："<<xyd<<endl; 
        cout<<"购买次数："<<gmcs<<endl; 
        cout<<"抽奖次数："<<cjcs<<endl;
        x=t7x[d]*pow(2,ddd/2)*pow(3,lll)+ex;
        g=t7g[d]*pow(2,ddd/2)*pow(3,lll)+eg;
    }
    cout<<"1.冒险模式 2.角色升级 3.每日免费领钱 4.夏日狂欢活动 5.人物进阶"<<endl;
    cout<<"6.人物简介 7.人物升头衔 8.技能 9.勇气值补充 10.挑战模式"<<endl;
    cout<<"11.赚钱区 12.体力值补充 13.更新公告和预告 14.无聊赚钱区"<<endl;
    cout<<"15.投资 16.商店 17.噩梦模式 18.查看自己的背包 19.借钱"<<endl; 
    cout<<"20.补充购买次数 21.抽奖 22.货币转换 23.有钱人家模式"<<endl; 
    cout<<"否则返回主菜单"<<endl;
    int x2;
    cin>>x2;
    system("cls");
    if(x2==1)cm();
    if(x2==2)sj();
    if(x2==3)lq(); 
    if(x2==4)xr();
    if(x2==5)jj();
    if(x2==6)rw();
    if(x2==7)tt();
    if(x2==8)jn();
    if(x2==9)by();
    if(x2==10)tz();
    if(x2==11)zq();
    if(x2==12)bt();
    if(x2==13)gy(); 
    if(x2==14)wl();
    if(x2==15)zc();
    if(x2==16)sd();
    if(x2==17)em();
    if(x2==18)bb();
    if(x2==19)jq();
    if(x2==20)bm();
    if(x2==21)cj();
    if(x2==22)hh();
    if(x2==23)yr();
    if(x2<=0||x2>=25)cf();
} 
int sj()
{
    int x3;
    if(d>=sjsx)
    {
        cout<<"级数已经达到上限"<<endl; 
    }
    else
    {
        cout<<"本次升级需要"<<a[d]<<"金币"<<endl;
        cout<<"1.确定升级 否则返回主界面"<<endl;
        cin>>x3;
        if(qian<a[d])
        {
            cout<<"你的金币不足"<<endl; 
        }
        if(x3==1&&qian>=a[d])
        {
            qian=qian-a[d];
            d++;
            cout<<"升级成功"<<endl; 
        }
    }
    cout<<"任意键返回主菜单"<<endl; 
    cin>>x3;
    cf();
}
int xrw()
{
    system("cls");
    cout<<"欢迎来到痛扁小怪兽"<<endl;
    cout<<"制作者：老李"<<endl;
    cout<<"选择人物"<<endl;
    cout<<"1.小x：攻击力是他的骄傲，血量却拖了他的后腿，喜好高攻击力的玩家的主要考虑对象"<<endl;
    cout<<"2.小y：血厚攻击力不高，主要用高血量和怪耗，比较适合当肉盾"<<endl;
    cout<<"3.小牛B：血中等攻击力也中等，升级的时候属性时而加的多，时而加的小，十分刺激"<<endl; 
    cout<<"4.小特工007：作为特工，攻击力十分巨大，但血量令人担忧"<<endl; 
    int x1;
    cin>>x1;
    if(x1==1)
    {
        js=1;
        ss="x";
    }
    if(x1==2)
    {
        js=2;
        ss="y"; 
    }
    if(x1==3) 
    {
        js=3;
        ss="牛B"; 
    } 
    if(x1==4)
    {
        js=4;
        ss="特工007"; 
    }
    if(x1<1||x1>4)
    {
        xrw();
        return 0;
    }
    cout<<"请输入你的用户名"<<endl;
    cin>>yhm; 
    cf(); 

    return 0;
}
int main()
{
    xrw();

    return 0;
}
